V2/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory

# --- Source OpenFOAM environment ---
if [ -n "$WM_PROJECT_DIR" ] && [ -f "$WM_PROJECT_DIR/etc/bashrc" ]; then
    OF_BASHRC="$WM_PROJECT_DIR/etc/bashrc"
else
    OF_BASHRC=""
    for candidate in \
        "/usr/lib/openfoam/openfoam2512/etc/bashrc" \
        "$HOME/OpenFOAM/OpenFOAM-2512/etc/bashrc" \
        "/opt/openfoam2512/etc/bashrc" \
        "/opt/OpenFOAM/OpenFOAM-2512/etc/bashrc"
    do
        if [ -f "$candidate" ]; then
            OF_BASHRC="$candidate"
            break
        fi
    done
fi

if [ -z "$OF_BASHRC" ]; then
    echo ">>> [ERROR] Cannot find OpenFOAM bashrc."
    exit 1
fi

# shellcheck disable=SC1090
. "$OF_BASHRC"

. "${WM_PROJECT_DIR}/bin/tools/RunFunctions"

# Determine if we need to remesh based on Python GUI flag
DO_MESH=0
if [ "$1" = "--mesh" ]; then
    DO_MESH=1
fi

echo ">>> [CLEANUP] Removing previous simulation results..."
# Carefully remove old time-steps and logs, but DO NOT delete constant/polyMesh
rm -rf [1-9]* 0.[0-9]* postProcessing processor* log.* *.foam

# Safely reset the '0' directory for a clean start
if [ -d 0.orig ]; then
    rm -rf 0
    cp -r 0.orig 0
else
    echo ">>> [WARNING] 0.orig not found. Assuming '0' is your golden copy."
fi

# Mesh generation logic
if [ "$DO_MESH" -eq 1 ]; then
    echo ">>> [STAGE 0] Generating new background mesh and carving STL..."
    rm -rf constant/polyMesh
    runApplication blockMesh
    runApplication snappyHexMesh -overwrite
    runApplication transformPoints -scale '(1 1 1)' 
else
    echo ">>> [STAGE 0] Skipping mesh generation. Using existing polyMesh..."
fi

# STAGE 1: Solve Fluid Flow (icoFoam)
echo ">>> [STAGE 1] Running icoFoam to establish flow field..."
runApplication icoFoam

# STAGE 2: Solve Particle Tracking
echo ">>> [STAGE 2] Tracking particles through the established flow..."
runApplication icoUncoupledKinematicParcelFoam

# Post-processing
touch case.foam
echo ">>> [COMPLETE] Pipeline finished successfully."