V2/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class vectorField; location "constant"; object kinematicCloudPositions; }
( (-0.00018 0.0 0.0) )
