V2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312/2315                             |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoUncoupledKinematicParcelFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0; // Updated by GUI

deltaT          1e-5; // High resolution for micro-scale physics

writeControl    runTime;

writeInterval   0.01; // Saves a frame every 0.01s for smooth video/animation

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

compression     off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;



// Required to load BrownianMotion particle force.
// It lives in liblagrangianTurbulence, which icoUncoupledKinematicParcelFoam
// does not link by default.
libs
(
    "liblagrangianTurbulence.so"
);

// ************************************************************************* //
